
&НаКлиенте
Процедура СканированиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Найти(текст,Символы.ПС)>0 И СокрЛП(Текст) <> "" Тогда
		СчитатьШтрихкод(СтрЗаменить(Текст, Символы.ПС, ""));
		ТекущийЭлемент = Элементы.Сканирование;
		Сканирование = "";
	КонецЕсли;
КонецПроцедуры

Процедура СчитатьШтрихкод(ШК)
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Отправления.Ссылка КАК Заказ,
	            |	Отправления.СлужбаДоставки,
	            |	Отправления.ИнтернетМагазин,
	            |	Отправления.СкладВозврата,
	            |	Отправления.НомерСД,
	            |	Отправления.Код КАК НомерЯндекс
	            |ИЗ
	            |	Справочник.Отправления КАК Отправления
	            |ГДЕ
	            |	Отправления.Код = &ШК";
	Зап.УстановитьПараметр("ШК", ШК);
	Рез = Зап.Выполнить().Выгрузить();
	Если Рез.Количество() <> 0 Тогда
		Нов = Объект.Отправления.Добавить();
		Нов.Отправление = Рез[0].Заказ;
		Нов.Штрихкод = ШК;
		
		СлужбаДоставки = Рез[0].СлужбаДоставки;
		ИнтернетМагазин = Рез[0].ИнтернетМагазин;
		СкладВозврата = Рез[0].СкладВозврата;
		НомерЗаказа = Рез[0].НомерЯндекс;
		Элементы.Сканирование.ЦветФона = WebЦвета.ЖелтоЗеленый;
	Иначе
		Нов = Объект.Отправления.Добавить();
		Нов.Штрихкод = ШК;		
		Элементы.Сканирование.ЦветФона = WebЦвета.Лосось;
	КонецеСли;
КонецПроцедуры	
