Функция ПолучитьИнтервалАвтоматическогоОбменаДанными() Экспорт
	Возврат Константы.ИнтервалАвтоматическогоОбменаДанными.Получить();
КонецФункции	

Процедура УстановитьIDПриложения(ID) Экспорт
	Константы.ИдентификаторИнформационнойБазы.Установить(ID.ИдентификаторИнформационнойБазы);
	Константы.ИдентификаторПриложения.Установить(ID.ИдентификаторПриложения);
	Константы.ИдентификаторУстройства.Установить(ID.ИдентификаторУстройства);
	Если ID.ТипПодписчика = ТипПодписчикаДоставляемыхУведомлений.APNS Тогда
		Константы.ТипПодписчика.Установить(Перечисления.ТипыПодписчиковУведомлений.APNS);
	ИначеЕсли ID.ТипПодписчика = ТипПодписчикаДоставляемыхУведомлений.GCM Тогда
		Константы.ТипПодписчика.Установить(Перечисления.ТипыПодписчиковУведомлений.GCM);
	КонецеСли;	
КонецПроцедуры	