
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Константы.ИдентификаторМобильногоУстройства.Получить()) Тогда
		Г = Новый УникальныйИдентификатор;
		Константы.ИдентификаторМобильногоУстройства.Установить(Строка(Г));
	КонецеСли;	
	
	Если Не ЗначениеЗаполнено(Константы.ПарольАдминистратора.Получить()) Тогда
		Константы.ПарольАдминистратора.Установить("887711");
	КонецеСли;	
	
	
	Если Не ЗначениеЗаполнено(Константы.УзелПланаОбмена.Получить()) Тогда
		ЭУ = ПланыОбмена.ИзмененныеОбъекты.ЭтотУзел().ПолучитьОбъект();
		ЭУ.Наименование = "МУ";
		ЭУ.Записать();
		
		ЦУ = ПланыОбмена.ИзмененныеОбъекты.НайтиПоКоду("000000002");
		Если ЦУ.Пустая() Тогда
			ЦУ = ПланыОбмена.ИзмененныеОбъекты.СоздатьУзел();
			ЦУ.Наименование = "ЦБ";
			ЦУ.Код = "000000002";
			ЦУ.Записать();
		КонецеСли;	
		
		Константы.УзелПланаОбмена.Установить(ЦУ.Ссылка);
		Константы.ТестоваяСреда.Установить(Истина);
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоЗабору);
	КонецеСли;	
	
		
	Заг = Константы.ЗаголовокСистемы.Получить();
	Если ЗначениеЗаполнено(Заг) Тогда
		Заголовок = "Сканирование (" + Константы.ЗаголовокСистемы.Получить() + ")";
	Иначе
		Заголовок = "Сканирование";
	КонецеСли;	
	
	ОсновнойСервер = Справочники.СерверыДанных.Сервер1.Ссылка;	
	Если Не ЗначениеЗаполнено(ОсновнойСервер.АдресWSDL) Или Не ЗначениеЗаполнено(ОсновнойСервер.АдресWSDLтест) Тогда
		Об = ОсновнойСервер.ПолучитьОбъект();
		Об.АдресWSDL = "http://188.138.57.232/Yandex_work/ws/Storage.1cws?wsdl";
		Об.АдресWSDLтест = "http://192.168.5.134/yasc/ws/Storage.1cws?wsdl";
		Об.Логин = "Admin";
		Об.Пароль = "losir7534qtg";
		Об.Записать();
	КонецеСли;
	
	СерверОбмена = Константы.СерверОбмена.Получить();
	Если СерверОбмена.Пустая() Тогда
		Константы.СерверОбмена.Установить(ОсновнойСервер.Ссылка);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ОткрытьФормуМодально("ОбщаяФорма.ФормаАвторизации");
	Если Ответ <> "Ok" Тогда
		Отказ = Истина;
		Возврат;
	КонецеСли;	
	
	//#Если МобильноеПриложениеКлиент Тогда
	//НомерПриложения = "679786957300";
	//IDПодписчика = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений(НомерПриложения);
	//ДоставляемыеУведомления.ПодключитьОбработчикУведомлений("ПриПолученииУведомления");
	//#КонецЕсли

КонецПроцедуры

