Процедура УдалитьМагазины() Экспорт
	Обр = Обработки.УдалениеЛишнихМагазинов.Создать();
	Обр.УдалитьЛишниеМагазины();	
КонецПроцедуры	

Процедура УстановитьРежимОприходования(НомерРежима) Экспорт
	Если НомерРежима = "1" Тогда
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоЗабору);
	ИначеЕсли НомерРежима = "2" Тогда
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоМагазину);
	ИначеЕсли НомерРежима = "3" Тогда
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоРеестру);
	КонецеСли;	
КонецПроцедуры	