
&НаКлиенте
Процедура ОткрытьФормуЛогаОшибок(Команда)
	ОткрытьФорму("РегистрСведений.ЛогОшибокОбменаДанными.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПользователей(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрыФ = Новый Структура;
	параметрыФ.Вставить("Администратор", Истина);
	
	Ответ = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.ФормаАвторизации", ПараметрыФ,,,,, Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
    //ВызватьИсключение "Вызов преобразован не полностью";//Присвоение cсылочного параметра: Отказ
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> "Ok" Тогда
		Закрыть();
	КонецеСли;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьСерверыДанныхНаСервере()
	// Вставить содержимое обработчика.
	ОбменДаннымиССервисом.ЗагрузитьСерверыДанных();
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьСерверыДанных(Команда)
	ЗагрузитьСерверыДанныхНаСервере();
КонецПроцедуры

