&НаСервере
Функция СчитатьШтрихкод(Штрихкод) Экспорт
	Зап = Новый Запрос;
	ВарСчитШтр = Константы.ВариантСчитыванияШтрихкода.Получить();
	
	Если ВарСчитШтр.Пустая() Или ВарСчитШтр = Перечисления.ВариантыСчитыванияШтрихкода.ПоНомеруЯндекса Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	Отправления.Ссылка Как Отправление
		|ИЗ
		|	Справочник.Отправления КАК Отправления
		|ГДЕ
		|	Отправления.Номер = &Штрихкод";
	ИначеЕсли ВарСчитШтр = Перечисления.ВариантыСчитыванияШтрихкода.ПоНомеруСД Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	Отправления.Ссылка Как Отправление
		|ИЗ
		|	Справочник.Отправления КАК Отправления
		|ГДЕ
		|	Отправления.НомерСД = &Штрихкод";		
	КонецеСли;	
	Зап.УстановитьПараметр("Штрихкод", СокрЛП(Штрихкод));
	
	Рез = Зап.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Справочники.Отправления.ПустаяСсылка();
	Иначе
		Выб = Рез.Выбрать();
		Если Выб.Следующий() Тогда
			Возврат Выб.Отправление;
		КонецЕсли;	
	КонецеСли;	
КонецФункции
